# Даны два файла, в каждом из которых находится
# запись многочлена. Задача - сформировать файл,
# содержащий сумму многочленов.

# from contextlib import nullcontext
# from dataclasses import replace


# with open('HomeWork\HomeWork_4\poly1.txt', 'r') as data:
# 		st1 = data.readlines()
# with open('HomeWork\HomeWork_4\poly2.txt', 'r') as data:
# 		st2 = data.readlines()

# def multiple_replace(target_str, replace_values):
# 	for i, j in replace_values.items():
# 		target_str = target_str.replace(i, j)
# 	return target_str

# poly1 = str(st1)
# poly2 = str(st2)
# replace_values = {' ': '', '=0': '', '^': '', '*': ''}

# print('Первый многочлен = ', st1)
# print('Второй многочлен = ', st2)

# print(multiple_replace(poly1, replace_values))
# print(multiple_replace(poly2, replace_values))

